#+TITLE: 20181210
#+title: Run vuejs in zeit/now
#+author: Xing Wenju
#+excerpt: Run unit test of vuejs
#+date: 2018-12-10
#+begin_src yaml :exports results :results value html
---
title: Run unit test of vuejs
author: Xing Wenju
excerpt: Run unit test of vuejs
date: 2018-12-10
---
#+end_src

* Test vue with now

#+BEGIN_SRC shell :results output replace :hlines yes
cd ~/workspace/now-examples
ls | grep nuxt
cd nuxt-static
now -f
#+END_SRC

#+RESULTS:
: nuxt-static
: https://nuxt-static-mkw9kgr2k.now.sh

* Test nextjs with now

#+BEGIN_SRC shell :results output replace :hlines yes
cd ~/workspace/now-examples
ls | grep next
cd nextjs-news
echo Do nextjs now
now -f
#+END_SRC

#+RESULTS:
: nextjs
: nextjs-news
: nextjs-static
: Do nextjs now
: https://nextjs-news-wp0p9zr6x.now.sh

* Test gridsome directory

#+BEGIN_SRC emacs-lisp
 (defun my-find-gridsome-filepath (gridsome-post-subdir)
	"Create the gridsome post in a specific hugo post directory"
	(interactive
		(let ((gridsome-post-subdirs '("blog" "docs" )))
				(list (ido-completing-read "Directory Name:" gridsome-post-subdirs))
		))
	(progn
			(setq daily-name (format-time-string "%Y-%m-%d"))
			(setq gridsome-post-filename
				(read-from-minibuffer "File Name：" "write-blog"))
      (if (string= gridsome-post-subdir "docs")
        ;; filpath: gridsome.org/docs/write-blog.md
        (setq gridsome-post-filepath
          (concat blog-gridsome-base-dir "/" gridsome-post-subdir "/" gridsome-post-filename ".md"))
        ;; filepath: gridsome.org/blog/2018-01-01-write-blog/index.md
        (setq gridsome-post-filepath
          (concat blog-gridsome-base-dir "/" gridsome-post-subdir "/" daily-name "-" gridsome-post-filename "/index.md")))
      (format "%s" gridsome-post-filepath)))

(message (my-find-gridsome-filepath "blog"))
#+END_SRC

#+RESULTS:
: /Users/linuxing3/workspace/gridsome.org/blog/2018-12-10-write-blog/index.md
